In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[16, '여','계남중'], [18, '여', '안산고']],
                 index=['진희', '민지'],
                 columns=['나이', '성별', '학교'])
print(df)

    나이 성별   학교
진희  16  여  계남중
민지  18  여  안산고

In [3]:
df.drop('진희', axis=0, inplace=True)
print(df)

    나이 성별   학교
민지  18  여  안산고

In [4]:
df.drop(['나이', '학교'], axis=1, inplace=True)
print(df)

   성별
민지  여

In [5]:
exam_data = {'수학':[100, 90, 70, 30, 40], '영어': [50, 100, 90, 80, 70], '언어': [50, 90, 70, 18, 100], '사회': [88, 100, 58, 77,95], '기가': [50, 100, 90, 80, 60],}
df = pd.DataFrame(exam_data, index=['서현', '유미', '예린', '지수', '이진'])

df

     수학   영어   언어   사회   기가
서현  100   50   50   88   50
유미   90  100   90  100  100
예린   70   90   70   58   90
지수   30   80   18   77   80
이진   40   70  100   95   60

In [6]:
df.loc['유미']

수학     90
영어    100
언어     90
사회    100
기가    100
Name: 유미, dtype: int64

In [7]:
# 0부터 시작(서현 = 0, 유미 = 1 ....)
df.iloc[4]

수학     40
영어     70
언어    100
사회     95
기가     60
Name: 이진, dtype: int64

In [8]:
df.loc['예린':]
df.loc[['지수', '서현']]
df.iloc[2:]
df.iloc[[3, 1]]

    수학   영어  언어   사회   기가
지수  30   80  18   77   80
유미  90  100  90  100  100

In [20]:
data1 = {
    '02.26' : ['SetList','Intro','WS','WBNW'],
    '02.27' : ['SetList', 'Intro','BNS','HPR'],
    '02.28' : ['SetList', 'Intro', 'NJP', 'NSNM'],
}
df = pd.DataFrame(data)

In [10]:
df

     02.26    02.27    02.28
0  SetList  SetList  SetList
1    Intro    Intro    Intro
2       WS      BNS      NJP
3     WBNW      HPR     NSNM

In [11]:
data = {
    '이름' : ['서현주','김은진','이유미','현지수'],
    '학년' : ['3학년', '1학년','2학년','1학년'],
    '키' : [150, 155, 170, 168],
}
df = pd.DataFrame(data)
df

    이름   학년    키
0  서현주  3학년  150
1  김은진  1학년  155
2  이유미  2학년  170
3  현지수  1학년  168

In [12]:
new_data = {
    '이름' : ['이상혁'],
    '학년' : ['2학년'],
    '키' : [176]
}
new_df = pd.DataFrame(new_data)

df = pd.concat([df,new_df])
df

    이름   학년    키
0  서현주  3학년  150
1  김은진  1학년  155
2  이유미  2학년  170
3  현지수  1학년  168
0  이상혁  2학년  176

In [13]:
new_data = {
    '이름' : '주은' ,
    '학년' : '1학년' ,
    '키' : 157
}
df = df.append(new_data, ignore_index=True)

In [14]:
df

    이름   학년    키
0  서현주  3학년  150
1  김은진  1학년  155
2  이유미  2학년  170
3  현지수  1학년  168
4  이상혁  2학년  176
5   주은  1학년  157

In [15]:
new_data = ['최예리','2학년', 168]

df.loc[len(df)] = ['최예리','2학년', 168]
df

    이름   학년    키
0  서현주  3학년  150
1  김은진  1학년  155
2  이유미  2학년  170
3  현지수  1학년  168
4  이상혁  2학년  176
5   주은  1학년  157
6  최예리  2학년  168

In [16]:
new_data = {
    '이름' : '진자임' ,
    '학년' : '1학년' ,
    '키' : 160
}

idx = 4
temp1 = df[df.index < idx]
temp2 = df[df.index >= idx]
df = temp1.append(new_data,ignore_index=True).append(temp2, ignore_index=True)
df

    이름   학년    키
0  서현주  3학년  150
1  김은진  1학년  155
2  이유미  2학년  170
3  현지수  1학년  168
4  진자임  1학년  160
5  이상혁  2학년  176
6   주은  1학년  157
7  최예리  2학년  168

In [17]:
print(df.이름)

0    서현주
1    김은진
2    이유미
3    현지수
4    진자임
5    이상혁
6     주은
7    최예리
Name: 이름, dtype: object

In [18]:
print(df['이름'])

0    서현주
1    김은진
2    이유미
3    현지수
4    진자임
5    이상혁
6     주은
7    최예리
Name: 이름, dtype: object

In [19]:
print(df[['이름']])

    이름
0  서현주
1  김은진
2  이유미
3  현지수
4  진자임
5  이상혁
6   주은
7  최예리

In [24]:
data1 = {
    '02.26' : ['SetList','Intro','WS','WBNW'],
    '02.27' : ['SetList', 'Intro','BNS','HPR'],
    '02.28' : ['SetList', 'Intro', 'NJP', 'NSNM'],
}
df = pd.DataFrame(data)

df = pd.DataFrame(data1, index=['SetList','Intro','WS','WBNW'])
df

           02.26    02.27    02.28
SetList  SetList  SetList  SetList
Intro      Intro    Intro    Intro
WS            WS      BNS      NJP
WBNW        WBNW      HPR     NSNM